package main

import (
	"fmt"
	"log"
	"strconv"

	tgbotapi "github.com/go-telegram-bot-api/telegram-bot-api/v5"
)

func Push_ups_from_the_floor(bot *tgbotapi.BotAPI, update tgbotapi.Update, updates tgbotapi.UpdatesChannel) { // ОТЖИМАНИЯ ОТ ПОЛА
	msg := tgbotapi.NewMessage(update.Message.Chat.ID, "Отжимания от пола. Введите максимальное количество за раз:")
	buttons := tgbotapi.NewReplyKeyboard(
		tgbotapi.NewKeyboardButtonRow(
			tgbotapi.NewKeyboardButton("Назад"),
		),
	)
	msg.ReplyMarkup = buttons
	_, err := bot.Send(msg)
	if err != nil {
		log.Panic(err)
	}

	for {
		update := <-updates
		if update.Message == nil {
			break
		}
		if update.Message.Text == "Назад" {
			Workout(bot, update, updates)
		}
		userCount, err := strconv.Atoi(update.Message.Text)
		if userCount < 0 || err != nil {
			msg := tgbotapi.NewMessage(update.Message.Chat.ID, "Введите положительное, целое число")
			_, err = bot.Send(msg)
			if err != nil {
				log.Panic(err)
			}
		} else {
			count := Push_ups_from_the_floor_CAL(userCount)
			msg = tgbotapi.NewMessage(update.Message.Chat.ID, count)
			buttons := tgbotapi.NewReplyKeyboard(
				tgbotapi.NewKeyboardButtonRow(
					tgbotapi.NewKeyboardButton("Назад"),
				),
				tgbotapi.NewKeyboardButtonRow(
					tgbotapi.NewKeyboardButton("Главное меню"),
				),
			)
			msg.ReplyMarkup = buttons
			_, err := bot.Send(msg)
			if err != nil {
				log.Panic(err)
			}
			log.Printf("[%s] %s", update.Message.From.UserName, update.Message.Text)
			for update := range updates {
				if update.Message == nil {
					continue
				}
				user := update.Message.Text
				switch user {
				case "Назад":
					Workout(bot, update, updates)
				case "Главное меню":
					Main_menu(bot, update, updates)
				default:
					msg := tgbotapi.NewMessage(update.Message.Chat.ID, "Нет такого варианта ответа")
					_, err := bot.Send(msg)
					if err != nil {
						log.Panic(err)
					}
				}
			}
		}
	}
}

func Push_ups_from_the_floor_CAL(userCount int) string {
	razdo5 := fmt.Sprintf("Каждая отдельная цифра это подход. Допустим запись (2 3 4) означает сделать 2 повторения, потом 3, потом 4. Отдыхайте 2-3 минуты между подходами. \nВот ваша программа тренировок: \n" + "\n" + "## 1 Неделя" + "\n" +
		"**Понедельник**" + "\n" + "- 2 3 2 2 3;" + "\n" +
		"**Среда**" + "\n" + "- 3 3 2 2 4;" + "\n" +
		"**Пятница**" + "\n" + "- 4 4 3 3 5;" + "\n" + "\n" + "## 2 Неделя" + "\n" +
		"**Понедельник**" + "\n" + "- 4 4 3 3 5;" + "\n" +
		"**Среда**" + "\n" + "- 5 5 4 4 7;" + "\n" +
		"**Пятница**" + "\n" + "- 5 6 4 4 7;" + "\n")
	raz6_10 := fmt.Sprintf("Каждая отдельная цифра это подход. Допустим запись (2 3 4) означает сделать 2 повторения, потом 3, потом 4. Отдыхайте 2-3 минуты между подходами. \nВот ваша программа тренировок: \n" + "\n" + "## 1 Неделя" + "\n" +
		"**Понедельник**" + "\n" + "- 5 6 4 4 5;" + "\n" +
		"**Среда**" + "\n" + "- 6 6 5 5 6;" + "\n" +
		"**Пятница**" + "\n" + "- 7 7 6 6 8;" + "\n" + "\n" + "## 2 Неделя" + "\n" +
		"**Понедельник**" + "\n" + "- 7 9 7 7 9;" + "\n" +
		"**Среда**" + "\n" + "- 8 9 8 8 10;" + "\n" +
		"**Пятница**" + "\n" + "- 10 11 8 8 12;" + "\n")
	raz11_15 := fmt.Sprintf("Каждая отдельная цифра это подход. Допустим запись (2 3 4) означает сделать 2 повторения, потом 3, потом 4. Отдыхайте 2-3 минуты между подходами. \nВот ваша программа тренировок: \n" + "\n" + "## 1 Неделя" + "\n" +
		"**Понедельник**" + "\n" + "- 8 9 7 7 8;" + "\n" +
		"**Среда**" + "\n" + "- 9 10 8 8 10;" + "\n" +
		"**Пятница**" + "\n" + "- 10 11 8 8 11;" + "\n" + "\n" + "## 2 Неделя" + "\n" +
		"**Понедельник**" + "\n" + "- 10 12 9 9 12;" + "\n" +
		"**Среда**" + "\n" + "- 11 12 10 10 13;" + "\n" +
		"**Пятница**" + "\n" + "- 12 14 11 11 14;" + "\n")
	raz16_20 := fmt.Sprintf("Каждая отдельная цифра это подход. Допустим запись (2 3 4) означает сделать 2 повторения, потом 3, потом 4. Отдыхайте 2-3 минуты между подходами. \nВот ваша программа тренировок: \n" + "\n" + "## 1 Неделя" + "\n" +
		"**Понедельник**" + "\n" + "- 12 14 12 12 14" + "\n" +
		"**Среда**" + "\n" + "- 12 15 12 12 16;" + "\n" +
		"**Пятница**" + "\n" + "- 13 15 13 13 16;" + "\n" + "\n" + "## 2 Неделя" + "\n" +
		"**Понедельник**" + "\n" + "- 14 15 13 13 17;" + "\n" +
		"**Среда**" + "\n" + "- 14 16 13 13 18;" + "\n" +
		"**Пятница**" + "\n" + "- 14 16 13 13 19;" + "\n")
	raz21_25 := fmt.Sprintf("Каждая отдельная цифра это подход. Допустим запись (2 3 4) означает сделать 2 повторения, потом 3, потом 4. Отдыхайте 2-3 минуты между подходами. \nВот ваша программа тренировок: \n" + "\n" + "## 1 Неделя" + "\n" +
		"**Понедельник**" + "\n" + "- 12 17 13 13 17;" + "\n" +
		"**Среда**" + "\n" + "- 14 18 14 14 18;" + "\n" +
		"**Пятница**" + "\n" + "- 15 19 15 15 19;" + "\n" + "\n" + "## 2 Неделя" + "\n" +
		"**Понедельник**" + "\n" + "- 15 20 16 16 20;" + "\n" +
		"**Среда**" + "\n" + "- 16 21 17 17 21;" + "\n" +
		"**Пятница**" + "\n" + "- 18 22 18 18 22;" + "\n")
	raz26_30 := fmt.Sprintf("Каждая отдельная цифра это подход. Допустим запись (2 3 4) означает сделать 2 повторения, потом 3, потом 4. Отдыхайте 2-3 минуты между подходами. \nВот ваша программа тренировок: \n" + "\n" + "## 1 Неделя" + "\n" +
		"**Понедельник**" + "\n" + "- 18 22 18 18 22;" + "\n" +
		"**Среда**" + "\n" + "- 19 23 18 18 23;" + "\n" +
		"**Пятница**" + "\n" + "- 20 24 20 20 25;" + "\n" + "\n" + "## 2 Неделя" + "\n" +
		"**Понедельник**" + "\n" + "- 22 25 20 20 27;" + "\n" +
		"**Среда**" + "\n" + "- 23 26 21 21 28;" + "\n" +
		"**Пятница**" + "\n" + "- 24 28 23 23 30;" + "\n")
	raz31_35 := fmt.Sprintf("Каждая отдельная цифра это подход. Допустим запись (2 3 4) означает сделать 2 повторения, потом 3, потом 4. Отдыхайте 2-3 минуты между подходами. \nВот ваша программа тренировок: \n" + "\n" + "## 1 Неделя" + "\n" +
		"**Понедельник**" + "\n" + "- 24 27 24 24 30;" + "\n" +
		"**Среда**" + "\n" + "- 26 28 24 24 30;" + "\n" +
		"**Пятница**" + "\n" + "- 26 28 25 25 30;" + "\n" + "\n" + "## 2 Неделя" + "\n" +
		"**Понедельник**" + "\n" + "- 27 30 26 26 31;" + "\n" +
		"**Среда**" + "\n" + "- 27 31 27 27 32;" + "\n" +
		"**Пятница**" + "\n" + "- 28 32 28 28 32;" + "\n")
	raz36_40 := fmt.Sprintf("Каждая отдельная цифра это подход. Допустим запись (2 3 4) означает сделать 2 повторения, потом 3, потом 4. Отдыхайте 2-3 минуты между подходами. \nВот ваша программа тренировок: \n" + "\n" + "## 1 Неделя" + "\n" +
		"**Понедельник**" + "\n" + "- 28 32 28 28 32;" + "\n" +
		"**Среда**" + "\n" + "- 30 32 29 29 33;" + "\n" +
		"**Пятница**" + "\n" + "- 31 33 29 29 34;" + "\n" + "\n" + "## 2 Неделя" + "\n" +
		"**Понедельник**" + "\n" + "- 32 34 30 30 35;" + "\n" +
		"**Среда**" + "\n" + "- 33 35 31 31 35;" + "\n" +
		"**Пятница**" + "\n" + "- 34 36 32 32 37;" + "\n")
	raz41_45 := fmt.Sprintf("Каждая отдельная цифра это подход. Допустим запись (2 3 4) означает сделать 2 повторения, потом 3, потом 4. Отдыхайте 2-3 минуты между подходами. \nВот ваша программа тренировок: \n" + "\n" + "## 1 Неделя" + "\n" +
		"**Понедельник**" + "\n" + "- 35 36 32 32 37;" + "\n" +
		"**Среда**" + "\n" + "- 35 37 33 33 38;" + "\n" +
		"**Пятница**" + "\n" + "- 36 38 34 34 38;" + "\n" + "\n" + "## 2 Неделя" + "\n" +
		"**Понедельник**" + "\n" + "- 36 39 35 35 39;" + "\n" +
		"**Среда**" + "\n" + "- 37 40 36 36 39;" + "\n" +
		"**Пятница**" + "\n" + "- 38 41 37 37 41;" + "\n")
	raz46_50 := fmt.Sprintf("Каждая отдельная цифра это подход. Допустим запись (2 3 4) означает сделать 2 повторения, потом 3, потом 4. Отдыхайте 2-3 минуты между подходами. \nВот ваша программа тренировок: \n" + "\n" + "## 1 Неделя" + "\n" +
		"**Понедельник**" + "\n" + "- 30 34 30 30 40;" + "\n" +
		"**Среда**" + "\n" + "- 19 19 23 23 19 19 22 37;" + "\n" +
		"**Пятница**" + "\n" + "- 20 20 27 27 21 21 21 44;" + "\n")
	raz51_55 := fmt.Sprintf("Каждая отдельная цифра это подход. Допустим запись (2 3 4) означает сделать 2 повторения, потом 3, потом 4. Отдыхайте 2-3 минуты между подходами. \nВот ваша программа тренировок: \n" + "\n" + "## 1 Неделя" + "\n" +
		"**Понедельник**" + "\n" + "- 30 39 35 35 42;" + "\n" +
		"**Среда**" + "\n" + "- 20 20 23 23 20 20 18 18 53;" + "\n" +
		"**Пятница**" + "\n" + "- 22 22 30 30 25 25 18 18 55;" + "\n")
	raz56_60 := fmt.Sprintf("Каждая отдельная цифра это подход. Допустим запись (2 3 4) означает сделать 2 повторения, потом 3, потом 4. Отдыхайте 2-3 минуты между подходами. \nВот ваша программа тренировок: \n" + "\n" + "## 1 Неделя" + "\n" +
		"**Понедельник**" + "\n" + "- 30 44 40 40 55;" + "\n" +
		"**Среда**" + "\n" + "- 22 22 27 27 24 23 18 18 58;" + "\n" +
		"**Пятница**" + "\n" + "- 26 26 33 33 26 26 22 22 60;" + "\n")
	raz61_65 := fmt.Sprintf("Каждая отдельная цифра это подход. Допустим запись (2 3 4) означает сделать 2 повторения, потом 3, потом 4. Отдыхайте 2-3 минуты между подходами. \nВот ваша программа тренировок: \n" + "\n" + "## 1 Неделя" + "\n" +
		"**Понедельник**" + "\n" + "- 33 44 42 42 47;" + "\n" +
		"**Среда**" + "\n" + "- 22 22 28 28 24 24 19 19 58;" + "\n" +
		"**Пятница**" + "\n" + "- 26 25 30 30 26 27 23 22 58;" + "\n")
	raz66_70 := fmt.Sprintf("Каждая отдельная цифра это подход. Допустим запись (2 3 4) означает сделать 2 повторения, потом 3, потом 4. Отдыхайте 2-3 минуты между подходами. \nВот ваша программа тренировок: \n" + "\n" + "## 1 Неделя" + "\n" +
		"**Понедельник**" + "\n" + "- 35 49 45 45 55;" + "\n" +
		"**Среда**" + "\n" + "- 22 22 30 30 24 24 18 18 59;" + "\n" +
		"**Пятница**" + "\n" + "- 28 28 32 32 27 27 23 23 60;" + "\n")
	raz71_75 := fmt.Sprintf("Каждая отдельная цифра это подход. Допустим запись (2 3 4) означает сделать 2 повторения, потом 3, потом 4. Отдыхайте 2-3 минуты между подходами. \nВот ваша программа тренировок: \n" + "\n" + "## 1 Неделя" + "\n" +
		"**Понедельник**" + "\n" + "- 36 51 46 45 56;" + "\n" +
		"**Среда**" + "\n" + "- 23 23 30 32 26 24 20 20 62;" + "\n" +
		"**Пятница**" + "\n" + "- 30 28 34 34 28 28 24 24 65;" + "\n")
	raz76_80 := fmt.Sprintf("Каждая отдельная цифра это подход. Допустим запись (2 3 4) означает сделать 2 повторения, потом 3, потом 4. Отдыхайте 2-3 минуты между подходами. \nВот ваша программа тренировок: \n" + "\n" + "## 1 Неделя" + "\n" +
		"**Понедельник**" + "\n" + "- 40 53 48 48 62;" + "\n" +
		"**Среда**" + "\n" + "- 28 24 33 33 28 28 22 22 65;" + "\n" +
		"**Пятница**" + "\n" + "- 32 29 35 35 30 30 23 22 68;" + "\n")
	raz81_85 := fmt.Sprintf("Каждая отдельная цифра это подход. Допустим запись (2 3 4) означает сделать 2 повторения, потом 3, потом 4. Отдыхайте 2-3 минуты между подходами. \nВот ваша программа тренировок: \n" + "\n" + "## 1 Неделя" + "\n" +
		"**Понедельник**" + "\n" + "- 40 53 48 48 62;" + "\n" +
		"**Среда**" + "\n" + "- 28 24 33 33 28 28 22 22 65;" + "\n" +
		"**Пятница**" + "\n" + "- 32 30 35 35 30 30 23 22 68;" + "\n")
	raz86_90 := fmt.Sprintf("Каждая отдельная цифра это подход. Допустим запись (2 3 4) означает сделать 2 повторения, потом 3, потом 4. Отдыхайте 2-3 минуты между подходами. \nВот ваша программа тренировок: \n" + "\n" + "## 1 Неделя" + "\n" +
		"**Понедельник**" + "\n" + "- 44 58 52 53 70;" + "\n" +
		"**Среда**" + "\n" + "- 30 26 35 35 31 32 26 26 70;" + "\n" +
		"**Пятница**" + "\n" + "- 34 31 37 37 32 32 28 28 73;" + "\n")
	raz91_95 := fmt.Sprintf("Каждая отдельная цифра это подход. Допустим запись (2 3 4) означает сделать 2 повторения, потом 3, потом 4. Отдыхайте 2-3 минуты между подходами. \nВот ваша программа тренировок: \n" + "\n" + "## 1 Неделя" + "\n" +
		"**Понедельник**" + "\n" + "- 47 62 55 57 75;" + "\n" +
		"**Среда**" + "\n" + "- 33 28 37 37 32 33 28 28 72;" + "\n" +
		"**Пятница**" + "\n" + "- 35 32 38 38 34 34 30 30 75;" + "\n")
	raz96_100 := fmt.Sprintf("Каждая отдельная цифра это подход. Допустим запись (2 3 4) означает сделать 2 повторения, потом 3, потом 4. Отдыхайте 2-3 минуты между подходами. \nВот ваша программа тренировок: \n" + "\n" + "## 1 Неделя" + "\n" +
		"**Понедельник**" + "\n" + "- 50 65 58 60 78;" + "\n" +
		"**Среда**" + "\n" + "- 35 30 39 39 35 35 30 30 75;" + "\n" +
		"**Пятница**" + "\n" + "- 37 35 39 40 36 36 33 32 77;" + "\n")

	var itog string
	switch userCount {
	case 0:
		itog = string("Попробуйте сначала делать облегчённые варианты, а затем возвращайтесь)")
	case 1, 2, 3, 4, 5:
		itog = string(razdo5)
	case 6, 7, 8, 9, 10:
		itog = string(raz6_10)
	case 11, 12, 13, 14, 15:
		itog = string(raz11_15)
	case 16, 17, 18, 19, 20:
		itog = string(raz16_20)
	case 21, 22, 23, 24, 25:
		itog = string(raz21_25)
	case 26, 27, 28, 29, 30:
		itog = string(raz26_30)
	case 31, 32, 33, 34, 35:
		itog = string(raz31_35)
	case 36, 37, 38, 39, 40:
		itog = string(raz36_40)
	case 41, 42, 43, 44, 45:
		itog = string(raz41_45)
	case 46, 47, 48, 49, 50:
		itog = string(raz46_50)
	case 51, 52, 53, 54, 55:
		itog = string(raz51_55)
	case 56, 57, 58, 59, 60:
		itog = string(raz56_60)
	case 61, 62, 63, 64, 65:
		itog = string(raz61_65)
	case 66, 67, 68, 69, 70:
		itog = string(raz66_70)
	case 71, 72, 73, 74, 75:
		itog = string(raz71_75)
	case 76, 77, 78, 79, 80:
		itog = string(raz76_80)
	case 81, 82, 83, 84, 85:
		itog = string(raz81_85)
	case 86, 87, 88, 89, 90:
		itog = string(raz86_90)
	case 91, 92, 93, 94, 95:
		itog = string(raz91_95)
	case 96, 97, 98, 99, 100:
		itog = string(raz96_100)
	}
	if userCount >= 100 {
		itog = string("Ого, наша программа не рассчитана на таких силачей как вы)")
	}
	count := itog
	return count
}
